Revit 2026 API

# ExternalFileUtils Class

---

A utility class containing functions related to external file references.

SystemObject Autodesk.Revit.DBExternalFileUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalFileUtils
```
```vb
Public NotInheritable Class ExternalFileUtils
```
```cpp
public ref class ExternalFileUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalFileUtils = class end
```

The ExternalFileUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAllExternalFileReferences | Gets the ids of all elements which are external file references. |
|  | GetExternalFileReference | Gets the external file referencing data for the given element. |
|  | GetFileBasedTempFolder | Gets a temp folder based on the given file name |
|  | IsExternalFileReference | Determines whether the given element represents an external file. |

Elements which are external file references refer to files outside of the base .rvt file. Examples include Revit links, CAD links, the element which stores the location of the keynote file, and rendering decals.

#### Reference

Autodesk.Revit.DB Namespace